In [1]:
import pandas as pd
import numpy as np

In [4]:
data_dic = {'Name':['sohail','danyal','hamza','zakriya'], 'Age': [27,28,22, np.nan]}

In [5]:
data = pd.DataFrame(data_dic)

In [6]:
data.head()

      Name   Age
0   sohail  27.0
1   danyal  28.0
2    hamza  22.0
3  zakriya   NaN

In [7]:
# we are filling empty int values. Here all the empty spaces will be filled with min int value. here we have just one.
data['Age'] = data['Age'].fillna(np.min(data['Age']))

In [8]:
data.head()

      Name   Age
0   sohail  27.0
1   danyal  28.0
2    hamza  22.0
3  zakriya  22.0